<template>
    <main1>
        <div>
            <div>
                <main>

                    <div class='sm:p-6 p-2'>

                        <div class='mt-16'>
                            <div class='w-full bg-gray-700 rounded-t-lg'>
                                <div class="py-5 px-5 justify-start items-start">
                                    <p class='px-2 text-2xl sm:text-4xl font-bold text-white'>Справка</p>
                                </div>
                            </div>
                            <div class='p-10 bg-white rounded-b-lg text-justify'>
                                <h3 class='font-bold text-lg'>Как зарегистрироваться на сайте?</h3>
                                <p>Для регистрации нажмите на иконку в верхнем
                                    правом углу страницы. В раскрывшемся списке выберите "Регистрация". Перед вами откроется форма, где нужно ввести свой контактный
                                    телефон и ФИО.</p>
                                <h3 class='font-bold text-lg mt-2'>Как узнать цену запчасти?</h3>
                                <p>Чтобы получить весь список предложений по интересуещей вас детали, нужно знать ее
                                    артикул или по-другому код запчасти. Получить артикул вы можете воспользовавшись
                                    каталогами на нашем сайте или любыми другими. Если у вас возникают трудности с
                                    подбором по каталогу, вы всегда можете запросить запчасть по VIN-коду. Помимо этого, в интернете существует много
                                    клубов посвященных конкретным маркам, где всегда можно узнать актуальную информацию
                                    о запчастях из первых уст.</p>
                                <h3 class='font-bold text-lg mt-2'>Что такое аналоги?</h3>
                                <p>Выполняя поиск по артикулу сайт предложит вам все возможные аналоги интересующей вас
                                    позиции. Аналог - это заменитель детали, выпущенный сторонним производителем, но в
                                    соответствии со всеми параметрами оригинальной запчасти.
                                    Внимание! В прайсе могут содержаться ошибки, и все аналоги требуют тщательной
                                    проверки на совместимость с вашим автомобилем. И, конечно же, качество заменителя не
                                    всегда соответствует оригинальной детали. Если у вас есть малейшие сомнения в выборе
                                    аналога - лучше выберите оригинал, или обратитесь за помощью в офис.</p>
                                <h3 class='font-bold text-lg mt-2'>Какую информацию можно узнать при поиске детали?</h3>
                                <p>После выполнения поиска по артикулу, система выдаст вам множество предложений.
                                    Стоит уделить внимание остатку,
                                    потому что если запчасть на складе в единственном экземпляре, то у нее больше шансов
                                    потеряться.</p>
                                <h3 class='font-bold text-lg mt-2'>Что обозначает столбец "статус"?</h3>
                                <p>В этом столбце указывается актуальное состояние по каждой заказанной вам позиции.
                                    Рассмотрим основные вариации:</p>

                                <p class='pl-4'><b>Ожидание оплаты</b> - заказ принят системой, но заморожен до проведения предоплаты</p>
                                <p class='pl-4'><b>Ожидание поставщика</b> - заказ принят в работу, система ожидает связи с постащиком</p>
                                <p class='pl-4'><b>Передано поставщику</b> - заказ размещен у поставщика</p>
                                <p class='pl-4'><b>Выкуплено - поставщик</b> подтвердил ваш заказ</p>
                                <p class='pl-4'><b>Отгружено поставщиком</b> - поставщик отправил ваш заказ</p>
                                <p class='pl-4'><b>Сортируется на центр.складе</b> - заказ поступил на центральный склад (обычно г.Москва)
                                </p>
                                <p class='pl-4'><b>Сортируется на регион.складе</b> - заказ поступил на ближайший к вашему офису склад</p>
                                <p class='pl-4'><b>Отправлено в офис</b> - заказ отправлен с регионального склада в ваш офис</p>
                                <p class='pl-4'><b>Готово к выдаче</b> - заказ поступил в офис, готов к выдаче клиенту</p>
                                <p class='pl-4'><b>Отказ поставки</b> - заказ доставить невозможно</p>
                                <h3 class='font-bold text-lg mt-2'>Некоторые позиции из моего заказа получили статус "Отказ поставки", почему?</h3>
                                <p>К сожалению, не всегда удается поставить клиенту все заказанные запчасти. Такое
                                    происходит по многим причинам, таким как: неактуальная информация в прайс-листе
                                    поставщика, повреждение детали, пересорт на складе, нарушение сроков поставки и т.д.
                                    Единственное, что можно сделать в такой ситуации - рассмотреть предложения с других
                                    складов и перезаказать деталь.</p>

                            </div>

                        </div>

                    </div>
                </main>
            </div>
        </div>
    </main1>
</template>

<script>
    import Main1 from '@/Pages/Frontend/Layouts/Main.vue'

    export default {
        props: ['partgroups'],
        components: {
            Main1
        },
        data() {
            return {

            }
        },
        methods: {

        },
        computed: {
            orderedGroups: function () {
                return _.orderBy(this.partgroups.groups, 'group_name')
            }
        }

    }
</script>